Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: You can add attributes by setting the `resource-attributes` tracer config that is described in the <<configuration-reference>>. Since this property can be overridden at runtime, the OpenTelemetry extension will pick up its value following the order of precedence that is described in the xref:config-reference.adoc#configuration_sources[Quarkus Configuration Reference].
ja_jp: link:#configuration-reference[設定リファレンス]に記載されている `resource-attributes` tracer configを設定することで、属性を追加することができます。このプロパティは実行時にオーバーライドすることができるため、OpenTelemetryエクステンションは、 link:config-reference.html#configuration_sources[Quarkus 設定リファレンス]に記載されている優先順位に従ってその値をピックアップします。

source: You can add attributes by setting the `resource-attributes` tracer config that is described in the xref:configuration-reference[OpenTelemetry Configuration Reference]. Since this property can be overridden at runtime, the OpenTelemetry extension will pick up its value following the order of precedence that is described in the xref:config-reference.adoc#configuration-sources[Quarkus Configuration Reference].
ja_jp: OpenTelemetry xref:configuration-reference[設定リファレンス] に記載されている `resource-attributes` tracer configを設定することで、属性を追加することができます。このプロパティは実行時にオーバーライドできるため、OpenTelemetryエクステンションは、 xref:config-reference.adoc#configuration-sources[Quarkus 設定リファレンス] に記載されている優先順位に従って値をピックアップします。

source: You can add it using a simple Maven command:
ja_jp: シンプルな Maven コマンドを使って追加することができます。

source: You can add more properties to it with `quarkus.oidc.authentication.extra-params`. For example, some OIDC providers might choose to return the authorization code as part of the redirect URI's fragment, which would break the authentication process. The following example shows how you can work around this issue:
ja_jp: `quarkus.oidc.authentication.extra-params` を使用して、さらにプロパティーを追加できます。 たとえば、一部の OIDC プロバイダーは、リダイレクト URI のフラグメントの一部として認可コードを返すことを選択する場合があり、これにより認証プロセスが中断されます。 次の例は、この問題を回避する方法を示しています。

source: You can add more properties to it with `quarkus.oidc.authentication.extra-params`. For example, some OIDC providers might return the authorization code in the redirect URI's fragment, which would break the authentication process. The following example shows how you can work around this issue:
ja_jp: `quarkus.oidc.authentication.extra-params` を使用して、さらにプロパティーを追加できます。 たとえば、一部の OIDC プロバイダーは、リダイレクト URI のフラグメントの一部として認可コードを返す場合があり、これにより認証プロセスが中断されます。 次の例は、この問題を回避する方法を示しています。

source: You can add more properties to it with `quarkus.oidc.authentication.extra-params`. For example, some OpenID Connect providers may choose to return the authorization code as part of the redirect URI's fragment which would break the authentication process - it can be fixed as follows:
ja_jp: `quarkus.oidc.authentication.extra-params` を使用すると、さらに多くのプロパティーを追加することができます。例えば、OpenID Connect プロバイダーによっては、認可コードをリダイレクト URI のフラグメントの一部として返すことを選択する場合があり、認証プロセスを壊してしまいます。これは以下のように修正することができます。

source: You can add multiple of these key-value pairs for all the data you know at build time that you need on the page.
ja_jp: ページに必要なことがビルド時にわかっているすべてのデータに対して、これらのキーと値のペアを複数追加できます。

source: You can add new fruits to the list via the following curl command:
ja_jp: 以下の curl コマンドで、新しいフルーツをリストに追加することができます:

source: You can add new roles to `SecurityIdentity` after checking a client certificate's common name (CN) attribute. The easiest way to add new roles is to use a certificate attribute to role mapping feature.
ja_jp: クライアント証明書のコモンネーム (CN) 属性を確認した後、 `SecurityIdentity` に新しいロールを追加できます。 新しいロールを追加する最も簡単な方法は、証明書属性をロールにマッピングする機能に使用することです。

source: You can add support for link:https://www.openapis.org/[OpenAPI] and link:https://swagger.io/tools/swagger-ui/[Swagger UI] by using the `quarkus-smallrye-openapi` extension.
ja_jp: `quarkus-smallrye-openapi` エクステンションを使用してlink:https://www.openapis.org/[OpenAPI] および link:https://swagger.io/tools/swagger-ui/[Swagger UI] のサポートを追加できます。

source: You can add support for link:https://www.openapis.org/[OpenAPI] and link:https://swagger.io/tools/swagger-ui/[Swagger-UI] by using the `quarkus-smallrye-openapi` extension.
ja_jp: `quarkus-smallrye-openapi` エクステンションを使うことで、 link:https://www.openapis.org/[OpenAPI]と link:https://swagger.io/tools/swagger-ui/[Swagger-UI]のサポートを追加することができます。

source: You can add support for more <<readers-writers,body parameter types>>.
ja_jp: さらにサポートを追加できます <<readers-writers,body parameter types>>。

source: You can add support for more xref:readers-writers[body parameter types].
ja_jp: より多くの xref:readers-writers[ボディパラメータタイプ] へのサポートを追加することが可能です。

source: You can add tests to your extension that test:
ja_jp: エクステンションには、以下をテストするテストを追加できます。

source: You can add the `liquibase-mongodb` extension to your project by running the following command in your project base directory:
ja_jp: プロジェクトのベース・ディレクトリで以下のコマンドを実行することで、 `liquibase-mongodb` エクステンションをプロジェクトに追加できます:

source: You can add the `logging-gelf` extension to your project by running the following command in your project base directory:
ja_jp: プロジェクトのベースディレクトリーで次のコマンドを実行すると、 `logging-gelf` エクステンションをプロジェクトに追加できます。

source: You can add the `messaging-kafka` extension to your project by running the following command in your project base directory:
ja_jp: プロジェクトのベースディレクトリーで次のコマンドを実行すると、 `messaging-kafka` エクステンションをプロジェクトに追加できます。

source: You can add the `messaging-pulsar` extensions to your project by running the following command in your project base directory:
ja_jp: プロジェクトのベースディレクトリーで次のコマンドを実行すると、 `messaging-pulsar` エクステンションをプロジェクトに追加できます。

source: You can add the `smallrye-reactive-messaging-kafka` extensions to your project by running the following command in your project base directory:
ja_jp: プロジェクトのベースディレクトリーで以下のコマンドを実行すると、 `smallrye-reactive-messaging-kafka` エクステンションをプロジェクトに追加することができます。

source: You can add the extension to your project using:
ja_jp: 次のコマンドでプロジェクトにエクステンションを追加することができます:

source: You can adjust the expiry date if you need to.
ja_jp: 必要であれば、有効期限を調整することができます。

source: You can allow (if you want, but you don't have to) your users to have more than one authenticator device, which means a single username can map to multiple credential IDs, all of which identify the same user.
ja_jp: ユーザーが複数のオーセンティケーターデバイスを持つことを許可することもできます (必要に応じてであり、必須ではありません)。 つまり、単一のユーザー名を複数の認証情報 ID にマップすることができ、それらはすべて同じユーザーを識別します。

source: You can already start the application in _dev mode_ using:
ja_jp: `./mvnw compile quarkus:dev` を実行すると、自動的に _開発者モード_ でアプリケーションを起動することができます。

source: You can also access the same endpoint URLs by using a browser.
ja_jp: ブラウザーを使用して同じエンドポイント URL にアクセスすることもできます。

source: You can also add actions to your Dev UI templates:
ja_jp: Dev UI テンプレートにアクションを追加することもできます。

source: You can also add any number of `else` blocks:
ja_jp: また、 `else` ブロックを何個でも追加することができます。

source: You can also add error messages
ja_jp: エラーメッセージを追加することもできます。

source: You can also additionally set the `watchedFiles` parameter to the set of files that are also monitored for changes. This is particularly useful if you are developing a Quarkus extension or any other library that is being used as a dependency in your testing Quarkus application. You can set the `watchedFiles` to the installed Maven artifact in your local repository that will trigger automatic testing application reload when the extension or the library is installed:
ja_jp: `watchedFiles` パラメーターを、変更が監視されるファイルセットに追加で設定することもできます。これは、Quarkus エクステンションや、テスト中の Quarkus アプリケーションで依存関係として使用されている他のライブラリーを開発している場合に特に役立ちます。`watchedFiles` をローカルリポジトリーにインストールされた Maven アーティファクトに設定すると、エクステンションまたはライブラリーがインストールされたときに、自動的なテストアプリケーションのリロードがトリガーされます。

source: You can also apply a set of conditions to all build steps in a given class with `@BuildSteps`:
ja_jp: `@BuildSteps` を使用して、特定のクラスのすべてのビルドステップに一連の条件を適用することもできます。

source: You can also automate the imports above. To do this, move your web assets from `src/main/resources/META-INF/resources` to `src/main/resources/web` and now replace the above scripts and imports with `{#bundle /}`:
ja_jp: 上記のインポートを自動化することもできます。これを行うには、Web アセットを `src/main/resources/META-INF/resources` から `src/main/resources/web` に移動します。 そして、上記のスクリプトとインポートを `{#bundle /}` に置き換えます。

source: You can also automate the validation part we mentioned in the previous section. You can use the https://docs.ansible.com/ansible/latest/collections/ansible/builtin/assert_module.html[ansible.builtin.assert] module and populate the https://docs.ansible.com/ansible/latest/collections/ansible/builtin/service_facts_module.html#examples[service facts] to ensure the systemd service of the Quarkus app is running, along with https://docs.ansible.com/ansible/latest/collections/ansible/builtin/uri_module.html[ansible.builtin.uri] to check that the Quarkus app is accessible.
ja_jp: 前のセクションで言及した検証部分も自動化できます。link:https://docs.ansible.com/ansible/latest/collections/ansible/builtin/assert_module.html[ansible.builtin.assert] モジュールを使用して、Quarkus アプリの systemd サービスが実行されていることを確認するために link:https://docs.ansible.com/ansible/latest/collections/ansible/builtin/service_facts_module.html#examples[サービスファクト] を入力し、さらに Quarkus アプリにアクセスできることを確認するために link:https://docs.ansible.com/ansible/latest/collections/ansible/builtin/uri_module.html[ansible.builtin.uri] を使用できます。

source: You can also build a https://quarkus.io/guides/building-native-image[native executable] but keep in mind that native executables are not portable and that you need one binary per supported platform.
ja_jp: https://quarkus.io/guides/building-native-image[ネイティブ実行可能ファイル] をビルドすることもできますが、ネイティブ実行可能ファイルは移植可能ではなく、サポートされているプラットフォームごとに 1 つのバイナリーが必要であることに注意してください。

source: You can also build a native application with `mvnw package -Dnative`, and launch it with something like:
ja_jp: また、 `mvnw package -Dnative` でネイティブアプリケーションをビルドし、次のような方法で起動することもできます：

source: You can also build and run our applications as native executables. First, compile both applications as native:
ja_jp: アプリケーションをネイティブ実行可能ファイルとしてビルドし、実行することもできます。まず、両方のアプリケーションをネイティブとしてコンパイルします。

source: You can also build the native executable using:
ja_jp: ネイティブ実行可能ファイルを次のようにビルドすることもできます。

source: You can also build your image locally and push it to a publicly accessible Docker registry, then use this image in the next step.
ja_jp: また、イメージをローカルにビルドして、公開されているDockerレジストリーにプッシュし、次のステップでこのイメージを使用することもできます。

source: You can also compile it as a native executable with:
ja_jp: 以下でネイティブ実行可能ファイルとしてコンパイルすることもできます。

source: You can also complement refreshing the expired ID tokens by proactively refreshing the valid ID tokens which are about to be expired within the `quarkus.oidc.token.refresh-token-time-skew` value. If, during the current user request, it is calculated that the current ID token will expire within this `quarkus.oidc.token.refresh-token-time-skew` then it will be refreshed and the new session cookie will be created. This property should be set to a value which is less than the ID token lifespan; the closer it is to this lifespan value the more often the ID token will be refreshed.
ja_jp: また、 `quarkus.oidc.token.refresh-token-time-skew` の値内で期限が切れそうな有効な ID トークンを積極的にリフレッシュして、期限切れの ID トークンを補完することも可能です。現在のユーザーリクエストの間に、現在の ID トークンがこの `quarkus.oidc.token.refresh-token-time-skew` 値の範囲内で期限切れとなることが計算されると、リフレッシュされて新しいセッションクッキーが作成されます。このプロパティーには、ID トークンの寿命よりも短い値を設定する必要があります。この寿命の値に近いほど、ID トークンはより頻繁にリフレッシュされます。

source: You can also configure `quarkus.mailer.trust-all=true` to bypass the verification.
ja_jp: また、 `quarkus.mailer.trust-all=true` を設定し、認証をバイパスするように設定することも可能です。

source: You can also configure a custom image compatible with standard images (kind, k3s & api-server) using the `quarkus.kubernetes-client.devservices.image-name` property. However, it must be consistent with the flavor and api-version properties:
ja_jp: `quarkus.kubernetes-client.devservices.image-name` プロパティーを使用すると、標準イメージ（kind、k3s、api-server）と互換性のあるカスタムイメージを設定することもできます。ただし、これはフレーバーおよび api-version プロパティーと一致している必要があります。

source: You can also configure properties supported by the underlying Pulsar consumer.
ja_jp: 基盤となる Pulsar コンシューマーがサポートするプロパティーを設定することもできます。

source: You can also configure properties supported by the underlying Pulsar producer.
ja_jp: 基盤となる Pulsar プロデューサーがサポートするプロパティーを設定することもできます。

source: You can also configure the authorization policies presented by this guide so far programmatically. Consider the example mentioned earlier:
ja_jp: これまでにこのガイドで紹介した認可ポリシーは、プログラムで設定することもできます。先ほど述べた例を考えてみましょう。

source: You can also configure the client to use a tls configuration from the TLS registry, this will enable tls:
ja_jp: TLSレジストリからtls設定を使用するようにクライアントを設定することもできます：

source: You can also configure the default `TokenStateManager` to encrypt the tokens before storing them as cookie values which may be necessary if the tokens contain sensitive claim values. For example, here is how you configure it to split the tokens and encrypt them:
ja_jp: また、デフォルトの `TokenStateManager` を設定して、トークンを暗号化してからクッキーの値として保存することもできます。これは、トークンが機密性の高い請求値を含む場合に必要な場合があります。例えば、トークンを分割して暗号化するように設定する方法は以下のとおりです。

source: You can also configure the following levels for applications and libraries that use link:https://docs.oracle.com/javase/8/docs/api/java/util/logging/Level.html[`java.util.logging`]:
ja_jp: link:https://docs.oracle.com/javase/8/docs/api/java/util/logging/Level.html[java.util.logging] を使用するアプリケーションやライブラリに対して、以下のレベルを設定することもできます。 :

source: You can also configure the management interface with the legacy SSL configuration, as for (xref:http-reference.adoc#ssl[the main HTTP server]):
ja_jp: (xref:http-reference.adoc#ssl[メイン HTTP サーバー]) のように、従来の SSL 設定を使用して管理インターフェイスを設定することもできます。

source: You can also configure the required user credentials, user name, secret, and roles. For example:
ja_jp: 必要なユーザー認証情報、ユーザー名、シークレット、およびロールを設定することもできます。 たとえば:

source: You can also configure the server directly using the following properties:
ja_jp: 次のプロパティーを使用してサーバーを直接設定することもできます。

source: You can also configure the time to live of the cached entries:
ja_jp: また、キャッシュされたエントリーの生存時間(TTL) を設定することも可能です:

source: You can also configure the timeout for stopping services with the `quarkus.compose.devservices.stop-timeout` property. After the timeout, Compose Dev Services will forcefully stop the services. The default timeout is deliberately chosen to be short (1 second) for fast cleanup, but you can increase it as needed:
ja_jp: `quarkus.compose.devservices.stop-timeout` プロパティーでサービスの停止タイムアウトを設定することもできます。タイムアウト後、Compose Dev Services はサービスを強制的に停止します。高速なクリーンアップのために、デフォルトのタイムアウトは意図的に短く (1 秒) 設定されていますが、必要に応じて長くすることができます。

source: You can also consider using a JSON Web Key (JWK) or JSON Web Key Set (JWK Set) format to store a secret key on a secure file system. You can reference the key by using the `smallrye.jwt.sign.key.location` or `smallrye.jwt.encrypt.key.location` properties.
ja_jp: また、JSON Web Key (JWK) または JSON Web Key Set (JWK Set) 形式を使用して、秘密鍵を安全なファイルシステムに保存することも検討できます。 `smallrye.jwt.sign.key.location` または `smallrye.jwt.encrypt.key.location` プロパティーを使用して、キーを参照できます。

source: You can also consider using a `JSON Web Key` (JWK) or `JSON Web Key Set` (JWK Set) format to store a secret key on a secure file system and refer to it using either `smallrye.jwt.sign.key.location` or `smallrye.jwt.encrypt.key.location` properties, for example:
ja_jp: また、 `JSON Web Key` (JWK) または `JSON Web Key Set` (JWK Set) 形式を使用して秘密鍵を安全なファイルシステムに保存し、 `smallrye.jwt.sign.key.location` または `smallrye.jwt.encrypt.key.location` プロパティーを使用してそれを参照する方法もあります。以下はその例です。

source: You can also consult the https://picocli.info/#_packaging_your_application[Picocli official documentation] for more general information about how to package Picocli applications.
ja_jp: Picocli アプリケーションをパッケージ化する方法に関するより一般的な情報については、https://picocli.info/#_packaging_your_application[Picocli 公式ドキュメント] を参照してください。

source: You can also copy classpath and file system resources to the container. For example, if your application configures Keycloak authorization with link:https://www.keycloak.org/docs/latest/authorization_services/index.html#_policy_js[JavaScript policies] that are deployed to Keycloak in a jar file, then you can configure `Dev Services for Keycloak` to copy this jar to the Keycloak container as follows:
ja_jp: クラスパスとファイルシステムリソースをコンテナーにコピーすることもできます。 たとえば、jar ファイルで Keycloak にデプロイされる link:https://www.keycloak.org/docs/latest/authorization_services/index.html#_policy_js[JavaScript ポリシー] を使用してアプリケーションが Keycloak 認証を設定する場合、次のようにしてこの jar を Keycloak コンテナーにコピーするように `Dev Services for Keycloak` を設定できます。

source: You can also count how often a number was checked (generally) by aggregating all of these values together.
ja_jp: これらの値をすべて集計することで、(一般的に) 数値がチェックされた頻度をカウントすることもできます。

source: You can also create a custom `java.security.Permission` class with additional constructor parameters. These additional parameters get matched with arguments of the method annotated with the `@PermissionsAllowed` annotation. Later, Quarkus instantiates your custom permission with actual arguments, with which the method annotated with the `@PermissionsAllowed` has been invoked.
ja_jp: 追加のコンストラクターパラメーターを使用してカスタム `java.security.Permission` クラスを作成することもできます。 これらの追加パラメーターは、 `@PermissionsAllowed` アノテーションが付けられたメソッドの引数とマッチします。 その後、Quarkus は、 `@PermissionsAllowed` アノテーションが付けられたメソッドが呼び出された実際の引数を使用して、カスタム権限をインスタンス化します。

source: You can also create a custom `java.security.Permission` class with additional constructor parameters. These additional parameters names get matched with arguments names of the method annotated with the `@PermissionsAllowed` annotation. Later, Quarkus instantiates your custom permission with actual arguments, with which the method annotated with the `@PermissionsAllowed` has been invoked.
ja_jp: 追加のコンストラクターパラメーターを使用してカスタム `java.security.Permission` クラスを作成することもできます。 これらの追加パラメーターの名前は、 `@PermissionsAllowed` アノテーションが付けられたメソッドの引数名と一致します。 その後、Quarkus は、 `@PermissionsAllowed` アノテーションが付けられたメソッドが呼び出された実際の引数を使用して、カスタム権限をインスタンス化します。

source: You can also create a native executable from this application without making any source code changes. A native executable removes the dependency on the JVM: everything needed to run the application on the target platform is included in the executable, allowing the application to run with minimal resource overhead.
ja_jp: ソースコードを変更することなく、このアプリケーションからネイティブ実行可能ファイルを作成することもできます。ネイティブ実行可能ファイルは、JVMへの依存を取り除きます。ターゲットプラットフォーム上でアプリケーションを実行するために必要なすべてのものが実行ファイルに含まれているため、アプリケーションを最小限のリソースオーバーヘッドで実行することができます。

source: You can also create a new `OidcClient` programmatically. For example, assume that you must create it at startup time:
ja_jp: 新しい `OidcClient` をプログラムで作成することもできます。たとえば、起動時に作成する必要があると仮定します。

source: You can also create a new `OidcClient` programmatically. For example, let's assume you must create it at startup time:
ja_jp: プログラムで新しい `OidcClient` を作成することもできます。たとえば、起動時に作成する必要があるとします。

source: You can also create a test:
ja_jp: テストを作成することもできます。

source: You can also create dependent actions as follows:
ja_jp: 次のように依存アクションを作成することもできます。

source: You can also create global `HttpSecurityPolicy` invoked on every request. Just do not implement the `io.quarkus.vertx.http.runtime.security.HttpSecurityPolicy.name` method and leave the policy nameless.
ja_jp: すべてのリクエストで呼び出されるグローバル `HttpSecurityPolicy` を作成することもできます。 `io.quarkus.vertx.http.runtime.security.HttpSecurityPolicy.name` メソッドを実装せず、ポリシーに名前を付けないままにします。

source: You can also declare a top-level Java class annotated with `@CheckedTemplate`:
ja_jp: また、 `@CheckedTemplate` でアノテーションされたトップレベルの Java クラスを宣言することもできます。

source: You can also declare link:{jaxrsspec}#exceptionmapper[exception mappers in the JAX-RS way].
ja_jp: link:{jaxrsspec}#exceptionmapper[JAX-RSの方式で例外マッパー] を宣言することもできます。

source: You can also declare link:{jaxrsspec}#exceptionmapper[exception mappers in the Jakarta REST way].
ja_jp: link:{jaxrsspec}#exceptionmapper[Jakarta REST の方法で例外マッパー] を宣言することもできます。

source: You can also declare other HTTP methods by declaring them as an annotation with the link:{jaxrsapi}/jakarta/ws/rs/HttpMethod.html[`@HttpMethod`] annotation:
ja_jp: link:{jaxrsapi}/jakarta/ws/rs/HttpMethod.html[`@HttpMethod`] アノテーションを付与したアノテーションを宣言することにより、他の HTTP メソッドを宣言することもできます。

source: You can also declare other HTTP methods by declaring them as an annotation with the link:{jaxrsapi}/javax/ws/rs/HttpMethod.html[`@HttpMethod`] annotation:
ja_jp: link:{jaxrsapi}/javax/ws/rs/HttpMethod.html[`@HttpMethod`] アノテーションを付与したアノテーションを宣言することにより、他の HTTP メソッドを宣言することもできます。

source: You can also define _extensions_. These extensions would be a set of custom attributes used when the proposed set of attributes is not enough for your use case.
ja_jp: _拡張_ を定義することもできます。これらの拡張は、提案された属性のセットがユースケースに十分でない場合に使用されるカスタム属性のセットになります。

source: You can also define a type-safe <<fragments,fragment>> in your Java code. A _native static_ method with the name that contains a dollar sign `$` denotes a method that represents a fragment of a type-safe template. The name of the fragment is derived from the annotated method name. The part before the last occurence of a dollar sign `$` is the method name of the related type-safe template. The part after the last occurence of a dollar sign is the fragment identifier. The strategy defined by the relevant `CheckedTemplate#defaultName()` is honored when constructing the defaulted names.
ja_jp: Java コード内で、タイプセーフな <<fragments,fragment>> も定義できます。 名前にドル記号 `$` が含まれる _native static_ メソッドは、タイプセーフなテンプレートのフラグメントを表すメソッドを示します。 フラグメントの名前は、アノテーションが付けられたメソッド名から導出されます。 最後に現れるドル記号 `$` の前にある部分は、関連するタイプセーフなテンプレートのメソッド名です。 最後に現れるドル記号の後にある部分は、フラグメント識別子です。 関連する `CheckedTemplate#defaultName()` で定義されたストラテジーは、デフォルト名を構築する際に適用されます。

source: You can also define a type-safe <<fragments,fragment>> of a type-safe template in your Java code. There are two ways to define a type-safe fragment:
ja_jp: Java コードで、タイプセーフなテンプレートのタイプセーフな <<fragments,フラグメント>> を定義することもできます。タイプセーフなフラグメントを定義するには、2 つの方法があります。

source: You can also define custom profiles, such as `%staging` in the following example:
ja_jp: 以下の例の `%staging` のように、カスタムプロファイルを定義することもできます：

source: You can also define type-safe templates in your Java code. If using <<resteasy_integration,templates in JAX-RS resources>>, you can rely on the following convention:
ja_jp: また、Java コードの中で、タイプセーフのテンプレートを定義することもできます。<<resteasy_integration,JAX-RS リソース内でテンプレート>> を使う場合は、以下の規約に従うことができます。

source: You can also define type-safe templates in your Java code. If using xref:resteasy_integration[templates in Jakarta REST resources], you can rely on the following convention:
ja_jp: また、Javaコードでタイプセーフのテンプレートを定義することもできます。Jakarta REST xref:resteasy_integration[リソースでテンプレート] を使用する場合は、以下の規約を頼ることができます:

source: You can also deploy the container image as a microservice in a Kubernetes cluster on Azure. To do that, follow this tutorial:
ja_jp: また、コンテナーイメージをマイクロサービスとしてAzure上のKubernetesクラスターにデプロイすることもできます。そのためには、このチュートリアルに従ってください。

source: You can also display your Build time data in a table if the structure allows it:
ja_jp: 構造上可能な場合は、ビルド時データをテーブルに表示することもできます。

source: You can also display your build time data using a qute template. All build time data keys are available to use in the template:
ja_jp: qute テンプレートを使用して、ビルド時データを表示することもできます。すべてのビルド時データキーは、テンプレートで使用できます。

source: You can also do this without type-safe templates:
ja_jp: また、タイプセーフのテンプレートを使わずに行うこともできます:

source: You can also execute custom command in a transaction.
ja_jp: また、トランザクション内でカスタムコマンドを実行することも可能です。

source: You can also extend the `io.quarkus.test.vertx.UniAsserterInterceptor` to wrap the injected `UniAsserter` and customize the default behavior. For example, the interceptor can be used to execute the assert methods within a separate database transaction.:
ja_jp: また、 `io.quarkus.test.vertx.UniAsserterInterceptor` を拡張して、注入された `UniAsserter` をラップし、デフォルトの挙動をカスタマイズすることもできます。たとえば、インターセプターを使用して、別のデータベーストランザクション内でアサートメソッドを実行することができます:

source: You can also find them on most of our Quarkus tooling:
ja_jp: また、Quarkusのほとんどのツールでも見つけることが出来ます:
